![](https://snag.gy/h9Xwf1.jpg)

<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Introduction to `pandas`

_Authors: Tim Book_

---

`pandas` is the most popular python package for managing datasets and is used extensively by data scientists.

### Learning Objectives

- Define the anatomy of DataFrames.
- Explore data with DataFrames.
- Practice plotting with pandas.

### Lesson Guide

- What is `pandas`?
- Reading data
- Exploring data
    - Filtering
    - Sorting
- Split-Apply-Combine
- Missing Values

In [35]:
!ls

Applications               Public
Applications (Parallels)   Section 3
Creative Cloud Files       Untitled.ipynb
DSI                        Untitled1.ipynb
Data Preproccessing tools  Untitled2.ipynb
Desktop                    cd
Documents                  get-pip.py
Downloads                  iCloud Drive (Archive)
GA-blog                    import
Lecture 7, 8, 9.ipynb      node
Library                    opt
Movies                     pip
Music                      polar
Myfirstnotebook.ipynb      python
Parallels                  seaborn-data
Pictures                   tmp
PlayOnMac's virtual drives untitled.txt
Practice.ipynb

<a id='introduction'></a>

### What is `pandas`?

---

- Data analysis library - **Panel data system** (doesn't actually have to do with the animal, sorry).
- Created by Wes McKinney and Open Sourced by AQR Capital Management, LLC 2009.
- Implemented in highly optimized Python/Cython.
- Most ubiquitous tool used to start data analysis projects within the Python scientific ecosystem.

### Pandas Use Cases

---

- Cleaning data / Munging
- Exploratory Data Analysis (EDA)
- Structuring data for plots or tabular display
- Joining disparate sources
- Filtering, extracting, or transforming

## Importing the Dynamic Trio
From here on out, we'll begin pretty much all of our notebooks with the following three imports.

* **pandas**: The library we'll be using to do pretty much all data manipulation.
* **numpy**: The library we'll need to do various other computations. Even if you don't think you'll need it to start, you'll probably end up using it later.
* **matplotlib**: The library we'll use most for plotting. More on this another day.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Discussion: Where do you think a data scientist spends most of their time?

`/poll "Where do you think a data scientist spends most of their time?" "Moving data" "Cleaning data" "Exploring data" "Plotting data" "Predictive modeling" anonymous limit 1`

<a id='loading_csvs'></a>

### Loading a csv into a DataFrame

---

Pandas can load many types of files, but one of the most common filetypes for storing data is in a `.csv` file. Let's load a dataset on UFO sightings from the `./datasets` directory:

In [2]:
!ls

README.md                          intro-to-pandas-starter-code.ipynb
assets                             sac-visual.pdf
datasets

In [3]:
!pwd

/Users/AdelAlsagoff/DSI/materials/2.01-2.02-intro-to-pandas

In [6]:
cd datasets

/Users/AdelAlsagoff/DSI/materials/2.01-2.02-intro-to-pandas/datasets

In [7]:
!pwd

/Users/AdelAlsagoff/DSI/materials/2.01-2.02-intro-to-pandas/datasets

In [8]:
!ls

cars.csv          exported_ufo.csv  movies.tbl
diamonds.csv      movie_ratings.tsv ufo.csv

In [9]:
ufo = pd.read_csv('ufo.csv')

In [25]:
ufo['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [ ]:
ufo'

In [2]:
!ls

README.md                          intro-to-pandas-starter-code.ipynb
assets                             sac-visual.pdf
datasets

In [4]:
cd datasets

/Users/AdelAlsagoff/DSI/materials/2.01-2.02-intro-to-pandas/datasets

In [5]:
!ls

cars.csv          movie_ratings.tsv ufo.csv
diamonds.csv      movies.tbl

In [6]:
!pwd

/Users/AdelAlsagoff/DSI/materials/2.01-2.02-intro-to-pandas/datasets

In [7]:
ufo = pd.read_csv('ufo.csv')

In [8]:
type(ufo)

pandas.core.frame.DataFrame

This creates a pandas object called a **DataFrame**. These are powerful containers for data with many built-in functions to explore and manipulate data.

We will barely scratch the surface of DataFrame functionality in this lesson, but over the course of this class you will become an expert at using them.

<a id='exploring_data'></a>

## Exploratory Data Analysis (EDA) with Python!

---

DataFrames come with built-in functionality that makes data exploration easy. 

Let's start by looking at the "head" of your data with the `.head()` built-in function. If run alone in a notebook cell, it will show you the first and last handful of columns and the first 5 rows.

In [11]:
ufo.head(10)

                   City Colors Reported Shape Reported State              Time
0                Ithaca             NaN       TRIANGLE    NY    6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ   6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO   2/15/1931 14:00
3               Abilene             NaN           DISK    KS    6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY   4/18/1933 19:00
5           Valley City             NaN           DISK    ND   9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA    6/15/1935 0:00
7                  Alma             NaN           DISK    MI    7/15/1936 0:00
8               Eklutna             NaN          CIGAR    AK  10/15/1936 17:00
9               Hubbard             NaN       CYLINDER    OR    6/15/1937 0:00

If we want to see the last part of our data, we can equivalently use the ```.tail()``` function.

In [12]:
ufo.tail()

               City Colors Reported Shape Reported State            Time
80538        Neligh             NaN         CIRCLE    NE  9/4/2014 23:20
80539  Uhrichsville             NaN          LIGHT    OH   9/5/2014 1:14
80540        Tucson        RED BLUE            NaN    AZ   9/5/2014 2:40
80541   Orland park             RED          LIGHT    IL   9/5/2014 3:43
80542      Loughman             NaN          LIGHT    FL   9/5/2014 5:30

<a id='data_dimensions'></a>

### Data dimensions

---

It's good to look at what the dimensions of your data are. The ```.shape``` property will tell you the rows and colum counts of your DataFrame.

In [14]:
ufo.shape

(80543, 5)

`/poll "In terms of rows, is this the largest dataset you've ever worked with?" "Yes" "No" "Not sure, but I'm not impressed anyway" anonymous limit 1`

You will notice that this is operates the same as `.shape` for numpy arrays/matricies. Pandas makes use of numpy under the hood for optimization and speed.

Look at the names of your columns with the ```.columns``` property.

In [15]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

Accessing a specific column is easy. You can use the bracket syntax just like python dictionaries with the string name of the column to extract that column.

In [17]:
ufo['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [24]:
ufo[['City']].head()

                   City
0                Ithaca
1           Willingboro
2               Holyoke
3               Abilene
4  New York Worlds Fair

In [19]:
df = pd.DataFrame({'column1':np.ones(20),'column2':np.ones(20)})

In [20]:
df

    column1  column2
0       1.0      1.0
1       1.0      1.0
2       1.0      1.0
3       1.0      1.0
4       1.0      1.0
5       1.0      1.0
6       1.0      1.0
7       1.0      1.0
8       1.0      1.0
9       1.0      1.0
10      1.0      1.0
11      1.0      1.0
12      1.0      1.0
13      1.0      1.0
14      1.0      1.0
15      1.0      1.0
16      1.0      1.0
17      1.0      1.0
18      1.0      1.0
19      1.0      1.0

In [ ]:
# Try to refrain from doing this...
# THREAD: Why shouldn't you rely on this? (There are several good reasons).

As you can see we can also use the ```.head()``` function on a single column, which is represented as a pandas Series object.

You can also access a column (as a DataFrame instead of a Series) or multiple columns with a list of strings.

In [ ]:
ufo.head()

<a id='dataframe_series'></a>

### DataFrame vs. Series

---

We've been playing with them, so I guess we should define them formally:

* A **`Series`** is a one-dimensional array of values **with an index**.
* A **`DataFrame`** is a two-dimensional array of values **with both a row and column index**.
* It turns out - each column of a `DataFrame` is actually a `Series`!

![](./assets/series-vs-df.png)

There is an important difference between using a list of strings and just a string with a column's name: when you use a list with the string it returns another **DataFrame**, but when you use just the string it returns a pandas **Series** object.

In [21]:
print(type(ufo['City']))
print(type(ufo[['City']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

<a id='info'></a>

### Examining your data with `.info()`

---

The `.info()` should be the first thing you look at when getting acquainted with a new dataset.

**Types** are very important.  They impact the way data will be represented in our machine learning models, how data can be joined, whether or not math operators can be applied, and when you can encounter unexpected results.

> _Typical problems when working with new datasets_:
> - Missing values
> - Unexpected types (string/object instead of int/float)
> - Dirty data (commas, dollar signs, unexpected characters, etc)
> - Blank values that are actually "non-null" or single white-space characters

`.info()` is a function that is available on every **DataFrame** object. It gives you information about:

- Name of column / variable attribute
- Type of index (RangeIndex is default)
- Count of non-null values by column / attribute
- Type of data contained in column / attribute
- Unqiue counts of dtypes (Pandas data types)
- Memory usage of our dataset

In [ ]:
ufo.info()

## Aside:  Working with "Big Data"

---

The term **Big Data** has become a little bit of a buzzword with no clear, consensus definition. The most common definition is that **Big Data are data that are too big to fit in your computer's memory.**

![](https://snag.gy/UGNamo.jpg)

The reason that this definition is good is because when your data size exceeds your RAM, you have to use a separate set of tools to solve your problems. For example:

* Spark (Week 7!)
* Hadoop
* Being clever with how you read and use data
    - Separate it into small chunks for example.

<a id='describe'></a>

## Quick Summaries

---

The `.describe()` function is very useful for taking a quick look at your data. It gives you some of the basic descriptive statistics.

You can use `.value_counts()` to get a good tabular view of a categorical variable.

In [26]:
!ls

cars.csv          movie_ratings.tsv ufo.csv
diamonds.csv      movies.tbl

In [28]:
# Let's read in the diamonds data set.
diamonds = pd.read_csv('diamonds.csv')

In [24]:
diamonds.head(20)

NameError: name 'diamonds' is not defined

In [30]:
# Let's describe the price
diamonds.shape

(53940, 10)

In [31]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53940 non-null  float64
 1   cut      53940 non-null  object
 2   color    53940 non-null  object
 3   clarity  53940 non-null  object
 4   depth    53940 non-null  float64
 5   table    53940 non-null  float64
 6   price    53940 non-null  int64
 7   x        53940 non-null  float64
 8   y        53940 non-null  float64
 9   z        53940 non-null  float64
dtypes: float64(6), int64(1), object(3)
memory usage: 4.1+ MB

In [32]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [34]:
# We can even do it to the whole DataFrame - what does that look like?
# What's missing?
diamonds['price'].describe()

count    53940.000000
mean      3932.799722
std       3989.439738
min        326.000000
25%        950.000000
50%       2401.000000
75%       5324.250000
max      18823.000000
Name: price, dtype: float64

In [38]:
set(diamonds['cut'])

{'Fair', 'Good', 'Ideal', 'Premium', 'Very Good'}

In [37]:
# Let's count up the cuts
diamonds['cut'].describe()

count     53940
unique        5
top       Ideal
freq      21551
Name: cut, dtype: object

In [39]:
diamonds.cut.value_counts()

Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: cut, dtype: int64

In [40]:
diamonds.cut.value_counts(normalize = True)

Ideal        0.399537
Premium      0.255673
Very Good    0.223990
Good         0.090953
Fair         0.029848
Name: cut, dtype: float64

In [ ]:
# Let's do the same thing, but normalized

```.describe()``` gives us these statistics:

- **count**, which is equivalent to the number of cells (rows)
- **mean**, the average of the values in the column
- **std**, which is the standard deviation
- **min**, the minimum value
- **25%**, the 25th percentile of the values 
- **50%**, the 50th percentile of the values, which is the equivalent to the median
- **75%**, the 75th percentile of the values
- **max**, the maximum value

There are built-in math functions that will work on all of the columns of a DataFrame at once, or subsets of the data.

I can use the `.mean()` function on the `ufo` DataFrame to get the mean for every column.

In [41]:
diamonds.mean()

carat       0.797940
depth      61.749405
table      57.457184
price    3932.799722
x           5.731157
y           5.734526
z           3.538734
dtype: float64

In [43]:
ufo.mean() #no numerical columns

Series([], dtype: float64)

In [44]:
diamonds.std()

carat       0.474011
depth       1.432621
table       2.234491
price    3989.439738
x           1.121761
y           1.142135
z           0.705699
dtype: float64

<a id='independent_practice'></a>

### Now you!

---

Now that we know a little bit about basic DataFrame use, let's practice on a new dataset.

> Pro tip:  You can use the "tab" key to browse filesystem resources when your cursor is in a string to get a relative reference to the files that can be loaded in Jupyter notebook.  Remember, you have to use your arrow keys to navigate the files populated in the UI. 

<img src="https://snag.gy/IlLNm9.jpg">

1. Read in the `cars.csv` dataset. (call it `cars`)
1. What is the mean `mpg` for cars in this dataset?

In [45]:
!ls

cars.csv          movie_ratings.tsv ufo.csv
diamonds.csv      movies.tbl

In [16]:
cars = pd.read_csv('cars.csv')

In [17]:
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [18]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 2.9 KB

In [51]:
cars['mpg'].mean()

20.090624999999996

In [19]:
cars['mpg'].value_counts()

10.4    2
21.4    2
30.4    2
22.8    2
15.2    2
19.2    2
21.0    2
18.1    1
32.4    1
14.7    1
21.5    1
15.5    1
15.8    1
17.8    1
27.3    1
26.0    1
19.7    1
15.0    1
18.7    1
16.4    1
33.9    1
24.4    1
14.3    1
17.3    1
13.3    1
Name: mpg, dtype: int64

## Filtering
We usually don't need to operate on the _whole_ dataset. A very common task is to parse it down to only the pieces we need.

In [20]:
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [21]:
v = np.array([12, 98, 9, 50, 23])

In [22]:
# What do you think the result of this cell is?
v[[True, False, True, False, True]]

array([12,  9, 23])

In [23]:
# How about this?
v < 40

array([ True, False,  True, False,  True])

In [60]:
# So...
v[v < 40]

array([12,  9, 23])

In [62]:
# And this?
cars['mpg'] > 30

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17     True
18     True
19     True
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27     True
28    False
29    False
30    False
31    False
Name: mpg, dtype: bool

In [65]:
cars[cars['mpg'] > 30]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

In [63]:
# Finally...
cars[cars['mpg'] > 30]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

Filtering in pandas uses vectors of booleans to describe inclusion or exclusion. `True` means you're in, `False` means you're out.

In [66]:
# This functions identically to the code above, and can sometimes feels a little cleaner.
# Variables that serve this function are sometimes called "masks"

mask = cars.mpg > 30
cars[mask]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

### Multiple Filters
Often we want to filter based on multiple conditions. We can use the usual "and" and "or" logic, but the symbols change for mystical (read: annoying) Python reasons.

In [33]:
pwd

'/Users/AdelAlsagoff'

In [72]:
# "And" logic - use ampersand (&)
# Note parentheses mandatory!
cars[mask & (cars.cyl >= 4)]

cars[(cars.mpg > 30) & (cars.cyl >= 4)

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

In [76]:
cars[(cars.mpg > 20) | (cars.cyl >= 4)]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

In [ ]:
# "Or" logic - use pipe (|)
cars[(cars.mpg > 30)  (cars.cyl >= 4)]

### Now you:

In [ ]:
# (THREAD): Show me all the UFO sightings in your hometown! (City and State)
# Anything interesting?
#find unique states, filter by chosen state 
#filter cities by your choosen state
#choose a city
#filter the entire state by your state amd city

In [77]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [78]:
set(ufo['State'])

{'AK',
 'AL',
 'AR',
 'AZ',
 'CA',
 'CO',
 'CT',
 'Ca',
 'DE',
 'FL',
 'Fl',
 'GA',
 'HI',
 'IA',
 'ID',
 'IL',
 'IN',
 'KS',
 'KY',
 'LA',
 'MA',
 'MD',
 'ME',
 'MI',
 'MN',
 'MO',
 'MS',
 'MT',
 'NC',
 'ND',
 'NE',
 'NH',
 'NJ',
 'NM',
 'NV',
 'NY',
 'OH',
 'OK',
 'OR',
 'PA',
 'RI',
 'SC',
 'SD',
 'TN',
 'TX',
 'UT',
 'VA',
 'VT',
 'WA',
 'WI',
 'WV',
 'WY'}

In [81]:
ufo['State'].value_counts().head(5)

CA    10743
WA     4809
FL     4804
TX     4186
NY     3677
Name: State, dtype: int64

In [90]:
state_mask = ufo.State == 'CA'

In [93]:
ufo[state_mask].head()

           City Colors Reported Shape Reported State             Time
6   Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00
10      Fontana             NaN          LIGHT    CA  8/15/1937 21:00
15  Forest Home             NaN         CIRCLE    CA   7/2/1941 11:30
16  Los Angeles             NaN            NaN    CA   2/25/1942 0:00
25    San Diego             NaN          CIGAR    CA   1/1/1944 12:00

In [95]:
ufo[state_mask].City.value_counts().head()

Los Angeles      413
San Diego        399
Sacramento       232
San Francisco    214
San Jose         209
Name: City, dtype: int64

In [94]:
city_mask = ufo.City == 'Los Angeles'

In [98]:
ufo[state_mask & city_mask].head()

            City Colors Reported Shape Reported State             Time
16   Los Angeles             NaN            NaN    CA   2/25/1942 0:00
151  Los Angeles             NaN           DISK    CA  2/15/1951 11:00
228  Los Angeles             NaN       FIREBALL    CA  4/15/1953 12:00
289  Los Angeles             RED         CIRCLE    CA   7/1/1954 22:00
395  Los Angeles             NaN      FORMATION    CA  3/15/1957 13:00

In [102]:
filter_ufo = ufo[state_mask & city_mask]
filter_ufo.value_counts()

City         Colors Reported  Shape Reported  State  Time
Los Angeles  YELLOW GREEN     OTHER           CA     12/27/2010 14:00    1
             ORANGE           CIRCLE          CA     4/28/2011 21:40     1
                              SPHERE          CA     9/22/2007 22:30     1
                                                     2/16/2013 14:50     1
                                                     11/22/2001 23:45    1
                                                                        ..
             RED              DISK            CA     4/22/2008 1:25      1
                              CIRCLE          CA     7/23/2009 1:45      1
                                                     7/1/1954 22:00      1
                                                     11/10/2012 19:40    1
             BLUE             FLASH           CA     9/13/2003 1:14      1
Length: 63, dtype: int64

In [ ]:
city_mask = ufo.City == 'Los Angeles'
state_mask = ufo.State == 'CA'
filter_ufo = ufo[state_mask & city_mask]

In [103]:
df = pd.DataFrame({'column_1': np.random.randint(0, 10, size = 10),
                   'column_2': np.random.randint(0, 10, size = 10),
                   'column_3': np.random.randint(0, 10, size = 10),
                   'column_4': np.random.randint(0, 10, size = 10),
                   'column_8': np.random.randint(0, 10, size = 10),
                   'column_9': np.random.randint(0, 10, size = 10),
                   'column_10': np.random.randint(0, 10, size = 10),
                   'column_11': np.random.randint(0, 10, size = 10),
                   'column_12': np.random.randint(0, 10, size = 10),
                   'column_5': np.random.randint(0, 10, size = 10),
                   'column_6': np.random.randint(0, 10, size = 10),
                   'column_7': np.random.randint(0, 10, size = 10)
                  })
columns_i_want = [3, 6, 8, 2]
# Challenge give me back only those columns whose last character(s) match the list.

In [109]:
column_names = ['column_'+ str(x) for x in columns_i_want]
print (column_names)

df[column_names]

['column_3', 'column_6', 'column_8', 'column_2']

   column_3  column_6  column_8  column_2
0         0         8         5         3
1         2         1         2         3
2         5         2         7         0
3         2         3         2         1
4         8         4         9         0
5         7         1         8         5
6         4         0         4         2
7         4         6         2         6
8         3         8         1         8
9         9         9         5         6

In [116]:
df['column_1']

0    8
1    3
2    0
3    0
4    3
5    6
6    6
7    6
8    3
9    6
Name: column_1, dtype: int64

In [117]:
df['column_1'][0:3]

0    8
1    3
2    0
Name: column_1, dtype: int64

### Aside: Some shortcuts

In [ ]:
cars[cars['mpg'].between(24, 30)]

In [ ]:
cars[~cars['mpg'].between(14, 31)]

In [ ]:
ufo[ufo['City'].isin(['Towaco', 'Montville'])]

<a id='indexing'></a>

## Pandas Indexing: `.loc` and `.iloc`

---

So far we've learned how to select both rows and columns. The savvy and skeptical student would have noticed a problem here. We have ambiguous notation! What does this do:

```python
data[something]
```

We can't tell! Is `something` a mask or a string? One selects rows, the other selects columns. **What if we wanted to filter rows and select columns at the same time?!**

Pandas has two properties that you can use for indexing:

- **`.loc`** indexes with the _labels_ for rows and columns axis.
- **`.iloc`** indexes with the _integer positions_ for rows and columns axis.
> There used to be a third, `.ix` which is now deprecated and shan't ever be used again.

## `.loc` is Most Common
The syntax of `.loc` is pretty intuitive:

```python
data.loc[rows, columns]
```

Where `rows` is often a filter (ie, a **mask**), and `columns` is a list of columns, or even just `:` to select all columns.

In [118]:
df.loc[0:10,['column_1','column_2']]

   column_1  column_2
0         8         3
1         3         3
2         0         0
3         0         1
4         3         0
5         6         5
6         6         2
7         6         6
8         3         8
9         6         6

In [119]:
df.loc[df.column_10 <5]

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6,column_7
2,0,0,5,6,7,8,2,4,8,1,2,6
3,0,1,2,1,2,5,4,3,7,3,3,6
6,6,2,4,4,4,5,0,5,9,6,0,5

### Acccctually.....
![](assets/actually.png)
According to **_The Zen of Python_**, explicit is better than implicit. `.loc` is explicit. **Most people choose to always use `.loc` instead of the ambiguous `data[something]` notation! This is a pretty good idea! When in doubt, use `.loc`!**

### `.iloc` is rare, but useful
The `i` stands for "integer" and will give you the actual zero-indexed numerical indices.

In [122]:
df

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6,column_7
0,8,3,0,2,5,3,6,1,8,3,8,4
1,3,3,2,6,2,2,6,2,7,7,1,2
2,0,0,5,6,7,8,2,4,8,1,2,6
3,0,1,2,1,2,5,4,3,7,3,3,6
4,3,0,8,7,9,7,9,1,2,6,4,5
5,6,5,7,7,8,1,6,7,3,8,1,2
6,6,2,4,4,4,5,0,5,9,6,0,5
7,6,6,4,2,2,2,9,4,3,5,6,1
8,3,8,3,2,1,0,7,3,5,6,8,9
9,6,6,9,9,5,3,7,2,8,5,9,2

In [120]:
df.iloc[0:3,3:7]

   column_4  column_8  column_9  column_10
0         2         5         3          6
1         6         2         2          6
2         6         7         8          2

In [127]:
df['column_1']
df.column_1
df['column_1'][::-1]
df.iloc[:,0:-1]

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6
0,8,3,0,2,5,3,6,1,8,3,8
1,3,3,2,6,2,2,6,2,7,7,1
2,0,0,5,6,7,8,2,4,8,1,2
3,0,1,2,1,2,5,4,3,7,3,3
4,3,0,8,7,9,7,9,1,2,6,4
5,6,5,7,7,8,1,6,7,3,8,1
6,6,2,4,4,4,5,0,5,9,6,0
7,6,6,4,2,2,2,9,4,3,5,6
8,3,8,3,2,1,0,7,3,5,6,8
9,6,6,9,9,5,3,7,2,8,5,9

In [130]:
df.loc[(df.column_1 > 3) &(df.column_10 != 0)]

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6,column_7
0,8,3,0,2,5,3,6,1,8,3,8,4
5,6,5,7,7,8,1,6,7,3,8,1,2
7,6,6,4,2,2,2,9,4,3,5,6,1
9,6,6,9,9,5,3,7,2,8,5,9,2

## Sorting

In [ ]:
# We can sort individual Series...

In [131]:
my_list = [2,5,7,3,8,3,7]

In [132]:
sorted(my_list)

[2, 3, 3, 5, 7, 7, 8]

In [135]:
# Or the entire DataFrame
df.column_1.sort_values(ascending=False)

0    8
9    6
7    6
6    6
5    6
8    3
4    3
1    3
3    0
2    0
Name: column_1, dtype: int64

In [137]:
cars.sort_values('mpg',ascending=False)

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2
3   21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
1   21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
0   21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
29  19.7    6  145.0  175  3.62  2.770  15.50   0   1     5     6
9   19.2    6  167.6  123  3.92  3.440  18.30   1   0     4     4
24  19.2    8  400.0  175  3.08  3.845  17.05   0   0     3     2
4   18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5   18.1    6  225.0  105  2.76  3.460  20.22   1   0     3     1
10  17.8    6  167.6  123  3.92  3.440  18.90   1   0     4     4
12  17.3    8  275.8  180  3.07  3.730  17.60   0   0     3     3
11  16.4    8  275.8  180  3.07  4.070  17.40   0   0     3     3
28  15.8    8  351.0  264  4.22  3.170  14.50   0   1     5     4
21  15.5    8  318.0  150  2.76  3.520  16.87   0   0     3     2
13  15.2    8  275.8  180  3.07  3.780  18.00   0   0     3     3
22  15.2    8  304.0  150  3.15  3.435  17.30   0   0     3     2
30  15.0    8  301.0  335  3.54  3.570  14.60   0   1     5     8
16  14.7    8  440.0  230  3.23  5.345  17.42   0   0     3     4
6   14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4

### Now You:

In [ ]:
ufo.Time = pd.to_datetime(ufo.Time)

In [ ]:
# Give me the 5 most recent UFO sightings in Roswell, New Mexico.
# You'll need to filter and use .sort_values()
# This is a hard one!

## Split-Apply-Combine

---

What if we want summary statistics _with respect to some categorical variable?_ For example, the price of a diamond probably varies widely between different diamond cuts. To tackle this problem, we'll use the **Split-Apply-Combine** technique. (This is sometimes called **MapReduce**, but is more of a special case of MapReduce). 

* **Split**: Separate your data into different DataFrames, one for each category.
* **Apply**: On each split-up DataFrame, apply some function or transformation (for example, the mean).
* **Combine**: Take the results and combine the split-up DataFrames back into one aggregate DataFrame.

This might sound complicated, but it's actually only two commands in pandas (the **Combine** step is done for us).

In [ ]:
# What is the mean price by diamond cut?

In [ ]:
# Can we just describe each price by cut?

In [ ]:
# What if I want my own recipe of statistics?

### Now You:
What is the mean miles per gallon for each cylinder size?

### Advanced Split-Apply-Combining
Feel free to skip!

In [ ]:
# What if I want my own home-spun aggregate function?

# Maybe the mean of the log-price is interesting to you?
def log_mean(p):
    return np.mean(np.log(p))

diamonds.groupby('cut')['price'].agg(['count', 'mean', log_mean])

In [ ]:
# What if I want functions of different columns?
diamonds.groupby('cut').agg({
    'price': {'count': 'count', 'price_mean': 'mean'},
    'carat': {'carat_mean': 'mean'}
})

## Adding, Dropping, Renaming, and `inplace` Methods

In [ ]:
# Adding a column is easy, just define it!
# What if I wanted km per gal instead of miles per gal?

In [ ]:
# Oops - that actually doesn't make sense since they'd be using liters anyway.
# Let's drop it.

In [ ]:
# But... it's not gone?

In [139]:
df.drop(['column_7'],axis = 1)

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6
0,8,3,0,2,5,3,6,1,8,3,8
1,3,3,2,6,2,2,6,2,7,7,1
2,0,0,5,6,7,8,2,4,8,1,2
3,0,1,2,1,2,5,4,3,7,3,3
4,3,0,8,7,9,7,9,1,2,6,4
5,6,5,7,7,8,1,6,7,3,8,1
6,6,2,4,4,4,5,0,5,9,6,0
7,6,6,4,2,2,2,9,4,3,5,6
8,3,8,3,2,1,0,7,3,5,6,8
9,6,6,9,9,5,3,7,2,8,5,9

In [138]:
df.head()

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6,column_7
0,8,3,0,2,5,3,6,1,8,3,8,4
1,3,3,2,6,2,2,6,2,7,7,1,2
2,0,0,5,6,7,8,2,4,8,1,2,6
3,0,1,2,1,2,5,4,3,7,3,3,6
4,3,0,8,7,9,7,9,1,2,6,4,5

In [145]:
df.drop(['column_7'], axis = 1, inplace = True)

KeyError: "['column_7'] not found in axis"

In [147]:
df

,column_1,column_2,column_3,column_4,column_8,column_9,column_10,column_11,column_12,column_5,column_6
0,8,3,0,2,5,3,6,1,8,3,8
1,3,3,2,6,2,2,6,2,7,7,1
2,0,0,5,6,7,8,2,4,8,1,2
3,0,1,2,1,2,5,4,3,7,3,3
4,3,0,8,7,9,7,9,1,2,6,4
5,6,5,7,7,8,1,6,7,3,8,1
6,6,2,4,4,4,5,0,5,9,6,0
7,6,6,4,2,2,2,9,4,3,5,6
8,3,8,3,2,1,0,7,3,5,6,8
9,6,6,9,9,5,3,7,2,8,5,9

a###  Inplace Methods!
There are several methods in pandas that don't "stick" unless you tell them to. These methods will always have `inplace=False` by default. If you want to run a method and have it "stick" - assign `inplace=True`.

For example...

### Renaming Columns

In [149]:
# Yuck - I hate spaces and capital letters
ufo.head()
ufo['1'] =np.nan
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,1
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,NaN
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,NaN
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,NaN
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,NaN
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,NaN

In [150]:
ufo.drop(['1'], axis = 1, inplace = True)
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [151]:

# Lowercaseifying is easy:
# The "columns" attribute of a DataFrame works just like a numpy array or Series.

ufo.columns = [col.lower() for col in ufo.columns]

In [152]:
ufo.head()

                   city colors reported shape reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [153]:
ufo.columns = [col.replace(" ","_") for col in ufo.columns]
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
# The .rename method

In [155]:
ufo.rename(columns = {'city':'town'}).head()

                   town colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [156]:
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### Aside: `str` and `dt` methods
There are a lot of familiar string and date operations we can perform on columns. Strangely, they exist within a pandas submodule and so have to be prefixed with `str` and `dt` respectively.

In [ ]:
ufo['shape'].str.lower().head()

In [ ]:
ufo['shape'].str.replace('O', 'BRO').head()

In [ ]:
# We already did this above, but datetime variables need to be converted specially.
# ufo['time'] = pd.to_datetime(ufo['time'])
ufo['time'].dt.year.head()

## Missing Values

In [ ]:
s = pd.Series([5, 7, np.nan, 2, 10])

In [ ]:
s

In [ ]:
# Hmm...

In [ ]:
# Easy way to filter out missings!

## Exporting Data
We can read data, but how do we save it so we can send it out? pandas has several methods of the form `.to_*()`.

In [157]:
ufo.to_csv("exported_ufo.csv",index=False)

In [158]:
!ls

cars.csv          exported_ufo.csv  movies.tbl
diamonds.csv      movie_ratings.tsv ufo.csv

<a id='review'></a>

### Review

---

 - What would we do with a dataset when we first acquire it?
 - What's important to consider when first looking at a dataset? 
 - What are some common problems we can run into with new data?
 - What are some common operations with DataFrames?
 - How do we slice? Index? Filter?

# EXTRA MATERIALS
![](assets/biohazard.png)
Everything that follows is considered advanced or "too much" for our first session with pandas, and may not be explicitly covered by the instructor. If the instructor _does_ cover it, please don't worry that you don't understand this on your first pass.

**THAT DOES NOT MEAN THESE TOPICS ARE UNIMPORTANT OR RARELY USED!** We highly _highly_ recommend you take a look at these on your own time.

### Merging

In [ ]:
movies = pd.read_csv(
    'datasets/movies.tbl',
    sep='|',
    encoding='latin1',
    header=None,
    names=['movie_id', 'title'],
    usecols=[0, 1]
)
movies.head()

In [ ]:
ratings = pd.read_csv(
    'datasets/movie_ratings.tsv',
    sep='\t',
    header=None,
    names=['user_id', 'movie_id', 'rating', 'timestamp']
)
ratings.head()

In [ ]:
movie_reviews = pd.merge(ratings, movies, how='left')
movie_reviews.head()

In [ ]:
print(movies.shape)
print(ratings.shape)
print(movie_reviews.shape)

### "Categorical" Variables
Despite the name, when pandas says "Categorical", they really mean "Ordinal" - that is, ordered categories.

For example, check out the following crosstab:

In [ ]:
pd.crosstab(diamonds['cut'], diamonds['color'])

The "cuts" are not in the right order! They're actually in alphabetical order. We can fix this by telling pandas that there really is an important ordering here.

In [ ]:
diamonds['cut'] = pd.Categorical(diamonds['cut'], categories=['Fair', 'Good', 'Very Good', 'Premium', 'Ideal'])
pd.crosstab(diamonds['cut'], diamonds['color'])

### Categorizing with `.map()`

In [ ]:
cars['cyl_word'] = cars['cyl'].map({4: 'Four', 6: 'Six', 8: 'Eight'})
cars['cyl_word'].value_counts()

In [ ]:
def is_efficient(x):
    if x > 20:
        return "Efficient"
    else:
        return "Wasteful"
    
cars['fuel_economy'] = cars['mpg'].map(is_efficient)
cars['fuel_economy'].value_counts()

### Advanced Data Manipulation with `.apply()`
The `.apply()` method is very similar to `.map()`, except more advanced. You can apply a function along any axis of a `DataFrame`. `.apply()` is our "Swiss army knife" for data manipulation - if something can't be solved with ordinary means, it might be time for a `.apply()`.

In [ ]:
sizes = pd.Series([8, 4, 5, 'L', 2, 12, 16, 8, 'XL'])

In [ ]:
def to_num(x):
    try:
        out = float(x)
    except:
        out = np.nan
    return out

In [ ]:
sizes.apply(to_num)

In [ ]:
cars.head()

In [ ]:
def describe_car(row):
    efficiency = row['fuel_economy'].lower()
    cyl = row['cyl_word'].lower()
    auto = 'automatic' if row['am'] == 1 else 'manual'
    print(f"This {cyl} cylinder car has {auto} transmission and a(n) {efficiency} fuel economy.")

In [ ]:
cars.head().apply(describe_car, axis=1)

In [29]:
!pwd

/Users/AdelAlsagoff

In [31]:
!ls

Applications               Public
Applications (Parallels)   Section 3
Creative Cloud Files       Untitled.ipynb
DSI                        Untitled1.ipynb
Data Preproccessing tools  Untitled2.ipynb
Desktop                    cd
Documents                  get-pip.py
Downloads                  iCloud Drive (Archive)
GA-blog                    import
Lecture 7, 8, 9.ipynb      node
Library                    opt
Movies                     pip
Music                      polar
Myfirstnotebook.ipynb      python
Parallels                  seaborn-data
Pictures                   tmp
PlayOnMac's virtual drives untitled.txt
Practice.ipynb

BONUS QUESTION: Why are there 5 "None" valus in the above output?